SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Application/Device/MM32SPIN0260/Include/reg_tim.h
/**
  * @brief TIM_CCER Register Bit Definition
  */
#define  TIM_CCER_CC1E_Pos                        (0)
#define  TIM_CCER_CC1E_Msk                        (0x1U << TIM_CCER_CC1E_Pos)                       /*!<Channel 1 input/capture output enable*/
#define  TIM_CCER_CC1E                            TIM_CCER_CC1E_Msk
#define  TIM_CCER_CC1P_Pos                        (1)
#define  TIM_CCER_CC1P_Msk                        (0x1U << TIM_CCER_CC1P_Pos)                       /*!<Channel 1 input/capture output polarity*/
#define  TIM_CCER_CC1P                            TIM_CCER_CC1P_Msk
#define  TIM_CCER_CC1NE_Pos                       (2)
#define  TIM_CCER_CC1NE_Msk                       (0x1U << TIM_CCER_CC1NE_Pos)                      /*!<Channel 1 complementary output enable*/
#define  TIM_CCER_CC1NE                           TIM_CCER_CC1NE_Msk
#define  TIM_CCER_CC1NP_Pos                       (3)
#define  TIM_CCER_CC1NP_Msk                       (0x1U << TIM_CCER_CC1NP_Pos)                      /*!<Channel 1 input/capture complementary output polarity*/
#define  TIM_CCER_CC1NP                           TIM_CCER_CC1NP_Msk
#define  TIM_CCER_CC2E_Pos                        (4)
#define  TIM_CCER_CC2E_Msk                        (0x1U << TIM_CCER_CC2E_Pos)                       /*!<Channel 2 input/capture output enable*/
#define  TIM_CCER_CC2E                            TIM_CCER_CC2E_Msk
#define  TIM_CCER_CC2P_Pos                        (5)
#define  TIM_CCER_CC2P_Msk                        (0x1U << TIM_CCER_CC2P_Pos)                       /*!<Channel 2 input capture output polarity*/
#define  TIM_CCER_CC2P                            TIM_CCER_CC2P_Msk
#define  TIM_CCER_CC2NE_Pos                       (6)
#define  TIM_CCER_CC2NE_Msk                       (0x1U << TIM_CCER_CC2NE_Pos)                      /*!<Channel 2 complementary output enable*/
#define  TIM_CCER_CC2NE                           TIM_CCER_CC2NE_Msk
#define  TIM_CCER_CC2NP_Pos                       (7)
#define  TIM_CCER_CC2NP_Msk                       (0x1U << TIM_CCER_CC2NP_Pos)                      /*!<Channel 2 input/capture complementary output polarity*/
#define  TIM_CCER_CC2NP                           TIM_CCER_CC2NP_Msk
#define  TIM_CCER_CC3E_Pos                        (8)
#define  TIM_CCER_CC3E_Msk                        (0x1U << TIM_CCER_CC3E_Pos)                       /*!<Channel 3 input/capture output enable*/
#define  TIM_CCER_CC3E                            TIM_CCER_CC3E_Msk
#define  TIM_CCER_CC3P_Pos                        (9)
#define  TIM_CCER_CC3P_Msk                        (0x1U << TIM_CCER_CC3P_Pos)                       /*!<Channel 3 input capture output polarity*/
#define  TIM_CCER_CC3P                            TIM_CCER_CC3P_Msk
#define  TIM_CCER_CC3NE_Pos                       (10)
#define  TIM_CCER_CC3NE_Msk                       (0x1U << TIM_CCER_CC3NE_Pos)                      /*!<Channel 3 complementary output enable*/
#define  TIM_CCER_CC3NE                           TIM_CCER_CC3NE_Msk
#define  TIM_CCER_CC3NP_Pos                       (11)
#define  TIM_CCER_CC3NP_Msk                       (0x1U << TIM_CCER_CC3NP_Pos)                      /*!<Channel 3 input/capture complementary output polarity*/
#define  TIM_CCER_CC3NP                           TIM_CCER_CC3NP_Msk
#define  TIM_CCER_CC4E_Pos                        (12)
#define  TIM_CCER_CC4E_Msk                        (0x1U << TIM_CCER_CC4E_Pos)                       /*!<Channel 4 capture/compare enable*/
#define  TIM_CCER_CC4E                            TIM_CCER_CC4E_Msk
#define  TIM_CCER_CC4P_Pos                        (13)
#define  TIM_CCER_CC4P_Msk                        (0x1U << TIM_CCER_CC4P_Pos)                       /*!<Channel 4 capture/compare output polarity*/
#define  TIM_CCER_CC4P                            TIM_CCER_CC4P_Msk
#define  TIM_CCER_CC4NE_Pos                       (14)
#define  TIM_CCER_CC4NE_Msk                       (0x1U << TIM_CCER_CC4NE_Pos)                      /*!<Capture/Compare 4 output enable*/
#define  TIM_CCER_CC4NE                           TIM_CCER_CC4NE_Msk
#define  TIM_CCER_CC4NP_Pos                       (15)
#define  TIM_CCER_CC4NP_Msk                       (0x1U << TIM_CCER_CC4NP_Pos)                      /*!<Channel 4 input/capture complementary output polarity*/
#define  TIM_CCER_CC4NP                           TIM_CCER_CC4NP_Msk

/**
  * @brief TIM_CNT Register Bit Definition
  */
#define  TIM_CNT_CNT_Pos                          (0)
#define  TIM_CNT_CNT_Msk                          (0xFFFFFFFFU << TIM_CNT_CNT_Pos)                  /*!<Counter value*/
#define  TIM_CNT_CNT                              TIM_CNT_CNT_Msk
#define  TIM_CNT_CNT_Bit0                         (0x00000001U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit1                         (0x00000002U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit2                         (0x00000004U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit3                         (0x00000008U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit4                         (0x00000010U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit5                         (0x00000020U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit6                         (0x00000040U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit7                         (0x00000080U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit8                         (0x00000100U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit9                         (0x00000200U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit10                        (0x00000400U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit11                        (0x00000800U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit12                        (0x00001000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit13                        (0x00002000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit14                        (0x00004000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit15                        (0x00008000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit16                        (0x00010000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit17                        (0x00020000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit18                        (0x00040000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit19                        (0x00080000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit20                        (0x00100000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit21                        (0x00200000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit22                        (0x00400000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit23                        (0x00800000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit24                        (0x01000000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit25                        (0x02000000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit26                        (0x04000000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit27                        (0x08000000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit28                        (0x10000000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit29                        (0x20000000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit30                        (0x40000000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit31                        (0x80000000U << TIM_CNT_CNT_Pos) 

/**
  * @brief TIM_PSC Register Bit Definition
  */
#define  TIM_PSC_PSC_Pos                          (0)
#define  TIM_PSC_PSC_Msk                          (0xFFFFU << TIM_PSC_PSC_Pos)                      /*!<Prescaler value*/
#define  TIM_PSC_PSC                              TIM_PSC_PSC_Msk
#define  TIM_PSC_PSC_Bit0                         (0x0001U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit1                         (0x0002U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit2                         (0x0004U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit3                         (0x0008U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit4                         (0x0010U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit5                         (0x0020U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit6                         (0x0040U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit7                         (0x0080U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit8                         (0x0100U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit9                         (0x0200U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit10                        (0x0400U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit11                        (0x0800U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit12                        (0x1000U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit13                        (0x2000U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit14                        (0x4000U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit15                        (0x8000U << TIM_PSC_PSC_Pos) 

/**
  * @brief TIM_ARR Register Bit Definition
  */
#define  TIM_ARR_ARR_Pos                          (0)
#define  TIM_ARR_ARR_Msk                          (0xFFFFFFFFU << TIM_ARR_ARR_Pos)                  /*!<Auto reload value*/
#define  TIM_ARR_ARR                              TIM_ARR_ARR_Msk
#define  TIM_ARR_ARR_Bit0                         (0x00000001U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit1                         (0x00000002U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit2                         (0x00000004U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit3                         (0x00000008U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit4                         (0x00000010U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit5                         (0x00000020U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit6                         (0x00000040U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit7                         (0x00000080U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit8                         (0x00000100U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit9                         (0x00000200U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit10                        (0x00000400U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit11                        (0x00000800U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit12                        (0x00001000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit13                        (0x00002000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit14                        (0x00004000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit15                        (0x00008000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit16                        (0x00010000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit17                        (0x00020000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit18                        (0x00040000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit19                        (0x00080000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit20                        (0x00100000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit21                        (0x00200000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit22                        (0x00400000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit23                        (0x00800000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit24                        (0x01000000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit25                        (0x02000000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit26                        (0x04000000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit27                        (0x08000000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit28                        (0x10000000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit29                        (0x20000000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit30                        (0x40000000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit31                        (0x80000000U << TIM_ARR_ARR_Pos) 

/**
  * @brief TIM_RCR Register Bit Definition
  */
#define  TIM_RCR_REP_Pos                          (0)
#define  TIM_RCR_REP_Msk                          (0xFFU << TIM_RCR_REP_Pos)                        /*!<Repeat counter value*/
#define  TIM_RCR_REP                              TIM_RCR_REP_Msk
#define  TIM_RCR_REP_Bit0                         (0x01U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit1                         (0x02U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit2                         (0x04U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit3                         (0x08U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit4                         (0x10U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit5                         (0x20U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit6                         (0x40U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit7                         (0x80U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_CNT_Pos                      (8)
#define  TIM_RCR_REP_CNT_Msk                      (0xFFU << TIM_RCR_REP_CNT_Pos)                    /*!<Real-time value written by the repeat counter*/
#define  TIM_RCR_REP_CNT                          TIM_RCR_REP_CNT_Msk
#define  TIM_RCR_REP_CNT_Bit0                     (0x01U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit1                     (0x02U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit2                     (0x04U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit3                     (0x08U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit4                     (0x10U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit5                     (0x20U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit6                     (0x40U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit7                     (0x80U << TIM_RCR_REP_CNT_Pos) 

/**
  * @brief TIM_CCR1 Register Bit Definition
  */
#define  TIM_CCR1_CCR1_Pos                        (0)
#define  TIM_CCR1_CCR1_Msk                        (0xFFFFFFFFU << TIM_CCR1_CCR1_Pos)                /*!<Channel 1 capture/compare value*/
#define  TIM_CCR1_CCR1                            TIM_CCR1_CCR1_Msk
#define  TIM_CCR1_CCR1_Bit0                       (0x00000001U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit1                       (0x00000002U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit2                       (0x00000004U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit3                       (0x00000008U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit4                       (0x00000010U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit5                       (0x00000020U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit6                       (0x00000040U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit7                       (0x00000080U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit8                       (0x00000100U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit9                       (0x00000200U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit10                      (0x00000400U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit11                      (0x00000800U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit12                      (0x00001000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit13                      (0x00002000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit14                      (0x00004000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit15                      (0x00008000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit16                      (0x00010000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit17                      (0x00020000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit18                      (0x00040000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit19                      (0x00080000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit20                      (0x00100000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit21                      (0x00200000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit22                      (0x00400000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit23                      (0x00800000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit24                      (0x01000000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit25                      (0x02000000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit26                      (0x04000000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit27                      (0x08000000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit28                      (0x10000000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit29                      (0x20000000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit30                      (0x40000000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit31                      (0x80000000U << TIM_CCR1_CCR1_Pos) 

/**
  * @brief TIM_CCR2 Register Bit Definition
  */
#define  TIM_CCR2_CCR2_Pos                        (0)
#define  TIM_CCR2_CCR2_Msk                        (0xFFFFFFFFU << TIM_CCR2_CCR2_Pos)                /*!<Channel 2 capture/compare value*/
#define  TIM_CCR2_CCR2                            TIM_CCR2_CCR2_Msk
#define  TIM_CCR2_CCR2_Bit0                       (0x00000001U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit1                       (0x00000002U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit2                       (0x00000004U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit3                       (0x00000008U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit4                       (0x00000010U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit5                       (0x00000020U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit6                       (0x00000040U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit7                       (0x00000080U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit8                       (0x00000100U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit9                       (0x00000200U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit10                      (0x00000400U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit11                      (0x00000800U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit12                      (0x00001000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit13                      (0x00002000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit14                      (0x00004000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit15                      (0x00008000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit16                      (0x00010000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit17                      (0x00020000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit18                      (0x00040000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit19                      (0x00080000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit20                      (0x00100000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit21                      (0x00200000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit22                      (0x00400000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit23                      (0x00800000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit24                      (0x01000000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit25                      (0x02000000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit26                      (0x04000000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit27                      (0x08000000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit28                      (0x10000000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit29                      (0x20000000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit30                      (0x40000000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit31                      (0x80000000U << TIM_CCR2_CCR2_Pos) 

/**
  * @brief TIM_CCR3 Register Bit Definition
  */
#define  TIM_CCR3_CCR3_Pos                        (0)
#define  TIM_CCR3_CCR3_Msk                        (0xFFFFFFFFU << TIM_CCR3_CCR3_Pos)                /*!<Channel 3 capture/compare value*/
#define  TIM_CCR3_CCR3                            TIM_CCR3_CCR3_Msk
#define  TIM_CCR3_CCR3_Bit0                       (0x00000001U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit1                       (0x00000002U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit2                       (0x00000004U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit3                       (0x00000008U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit4                       (0x00000010U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit5                       (0x00000020U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit6                       (0x00000040U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit7                       (0x00000080U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit8                       (0x00000100U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit9                       (0x00000200U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit10                      (0x00000400U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit11                      (0x00000800U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit12                      (0x00001000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit13                      (0x00002000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit14                      (0x00004000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit15                      (0x00008000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit16                      (0x00010000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit17                      (0x00020000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit18                      (0x00040000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit19                      (0x00080000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit20                      (0x00100000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit21                      (0x00200000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit22                      (0x00400000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit23                      (0x00800000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit24                      (0x01000000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit25                      (0x02000000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit26                      (0x04000000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit27                      (0x08000000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit28                      (0x10000000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit29                      (0x20000000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit30                      (0x40000000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit31                      (0x80000000U << TIM_CCR3_CCR3_Pos) 

