SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Application/Device/MM32SPIN0260/Include/reg_tim.h
/**
  * @brief TIM_CCR4 Register Bit Definition
  */
#define  TIM_CCR4_CCR4_Pos                        (0)
#define  TIM_CCR4_CCR4_Msk                        (0xFFFFFFFFU << TIM_CCR4_CCR4_Pos)                /*!<Channel 4 capture/compare value*/
#define  TIM_CCR4_CCR4                            TIM_CCR4_CCR4_Msk
#define  TIM_CCR4_CCR4_Bit0                       (0x00000001U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit1                       (0x00000002U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit2                       (0x00000004U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit3                       (0x00000008U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit4                       (0x00000010U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit5                       (0x00000020U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit6                       (0x00000040U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit7                       (0x00000080U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit8                       (0x00000100U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit9                       (0x00000200U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit10                      (0x00000400U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit11                      (0x00000800U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit12                      (0x00001000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit13                      (0x00002000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit14                      (0x00004000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit15                      (0x00008000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit16                      (0x00010000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit17                      (0x00020000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit18                      (0x00040000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit19                      (0x00080000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit20                      (0x00100000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit21                      (0x00200000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit22                      (0x00400000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit23                      (0x00800000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit24                      (0x01000000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit25                      (0x02000000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit26                      (0x04000000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit27                      (0x08000000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit28                      (0x10000000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit29                      (0x20000000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit30                      (0x40000000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit31                      (0x80000000U << TIM_CCR4_CCR4_Pos) 

/**
  * @brief TIM_BDTR Register Bit Definition
  */
#define  TIM_BDTR_DTG_Pos                         (0)
#define  TIM_BDTR_DTG_Msk                         (0xFFU << TIM_BDTR_DTG_Pos)                       /*!<Dead-time generator setup adjustment*/
#define  TIM_BDTR_DTG                             TIM_BDTR_DTG_Msk
#define  TIM_BDTR_DTG_Bit0                        (0x01U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit1                        (0x02U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit2                        (0x04U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit3                        (0x08U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit4                        (0x10U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit5                        (0x20U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit6                        (0x40U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit7                        (0x80U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_LOCK_Pos                        (8)
#define  TIM_BDTR_LOCK_Msk                        (0x3U << TIM_BDTR_LOCK_Pos)                       /*!<Lock configuration*/
#define  TIM_BDTR_LOCK                            TIM_BDTR_LOCK_Msk
#define  TIM_BDTR_LOCK_Bit0                       (0x1U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_LOCK_Bit1                       (0x2U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_OSSI_Pos                        (10)
#define  TIM_BDTR_OSSI_Msk                        (0x1U << TIM_BDTR_OSSI_Pos)                       /*!<Off state selection in the idle mode*/
#define  TIM_BDTR_OSSI                            TIM_BDTR_OSSI_Msk
#define  TIM_BDTR_OSSR_Pos                        (11)
#define  TIM_BDTR_OSSR_Msk                        (0x1U << TIM_BDTR_OSSR_Pos)                       /*!<Off state selection in the run mode*/
#define  TIM_BDTR_OSSR                            TIM_BDTR_OSSR_Msk
#define  TIM_BDTR_BKE_Pos                         (12)
#define  TIM_BDTR_BKE_Msk                         (0x1U << TIM_BDTR_BKE_Pos)                        /*!<Break function enable*/
#define  TIM_BDTR_BKE                             TIM_BDTR_BKE_Msk
#define  TIM_BDTR_BKP_Pos                         (13)
#define  TIM_BDTR_BKP_Msk                         (0x1U << TIM_BDTR_BKP_Pos)                        /*!<Break input polarity*/
#define  TIM_BDTR_BKP                             TIM_BDTR_BKP_Msk
#define  TIM_BDTR_AOE_Pos                         (14)
#define  TIM_BDTR_AOE_Msk                         (0x1U << TIM_BDTR_AOE_Pos)                        /*!<Auto output enable*/
#define  TIM_BDTR_AOE                             TIM_BDTR_AOE_Msk
#define  TIM_BDTR_MOE_Pos                         (15)
#define  TIM_BDTR_MOE_Msk                         (0x1U << TIM_BDTR_MOE_Pos)                        /*!<Main output enable*/
#define  TIM_BDTR_MOE                             TIM_BDTR_MOE_Msk
#define  TIM_BDTR_DOE_Pos                         (16)
#define  TIM_BDTR_DOE_Msk                         (0x1U << TIM_BDTR_DOE_Pos)                        /*!<Direct output enable*/
#define  TIM_BDTR_DOE                             TIM_BDTR_DOE_Msk

/**
  * @brief TIM_DCR Register Bit Definition
  */
#define  TIM_DCR_DBA_Pos                          (0)
#define  TIM_DCR_DBA_Msk                          (0x1FU << TIM_DCR_DBA_Pos)                        /*!<DMA base address*/
#define  TIM_DCR_DBA                              TIM_DCR_DBA_Msk
#define  TIM_DCR_DBA_Bit0                         (0x01U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit1                         (0x02U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit2                         (0x04U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit3                         (0x08U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit4                         (0x10U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBL_Pos                          (8)
#define  TIM_DCR_DBL_Msk                          (0x1FU << TIM_DCR_DBL_Pos)                        /*!<DMA continuous transmission length*/
#define  TIM_DCR_DBL                              TIM_DCR_DBL_Msk
#define  TIM_DCR_DBL_Bit0                         (0x01U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit1                         (0x02U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit2                         (0x04U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit3                         (0x08U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit4                         (0x10U << TIM_DCR_DBL_Pos) 

/**
  * @brief TIM_DMAR Register Bit Definition
  */
#define  TIM_DMAR_DMAB_Pos                        (0)
#define  TIM_DMAR_DMAB_Msk                        (0xFFFFU << TIM_DMAR_DMAB_Pos)                    /*!<DMA register for burst accesses*/
#define  TIM_DMAR_DMAB                            TIM_DMAR_DMAB_Msk
#define  TIM_DMAR_DMAB_Bit0                       (0x0001U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit1                       (0x0002U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit2                       (0x0004U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit3                       (0x0008U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit4                       (0x0010U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit5                       (0x0020U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit6                       (0x0040U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit7                       (0x0080U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit8                       (0x0100U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit9                       (0x0200U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit10                      (0x0400U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit11                      (0x0800U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit12                      (0x1000U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit13                      (0x2000U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit14                      (0x4000U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit15                      (0x8000U << TIM_DMAR_DMAB_Pos) 

/**
  * @brief TIM_OR Register Bit Definition
  */

/* OR */
#define  TIM_OR_ETR_RMP_Pos                       (0)
#define  TIM_OR_ETR_RMP_Msk                       (0x3U << TIM_OR_ETR_RMP_Pos)                      /*!<ETR multiplex*/
#define  TIM_OR_ETR_RMP                           TIM_OR_ETR_RMP_Msk
#define  TIM_OR_ETR_RMP_Bit0                      (0x1U << TIM_OR_ETR_RMP_Pos) 
#define  TIM_OR_ETR_RMP_Bit1                      (0x2U << TIM_OR_ETR_RMP_Pos) 

/* CCR1_EXT */
#define  TIM_OR_CCR1_EXT_Pos                      (0)
#define  TIM_OR_CCR1_EXT_Msk                      (0xFFFFU << TIM_OR_CCR1_EXT_Pos)                  /*!<Capture/Compare 1 value*/
#define  TIM_OR_CCR1_EXT                          TIM_OR_CCR1_EXT_Msk
#define  TIM_OR_CCR1_EXT_Bit0                     (0x0001U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit1                     (0x0002U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit2                     (0x0004U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit3                     (0x0008U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit4                     (0x0010U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit5                     (0x0020U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit6                     (0x0040U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit7                     (0x0080U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit8                     (0x0100U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit9                     (0x0200U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit10                    (0x0400U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit11                    (0x0800U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit12                    (0x1000U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit13                    (0x2000U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit14                    (0x4000U << TIM_OR_CCR1_EXT_Pos) 
#define  TIM_OR_CCR1_EXT_Bit15                    (0x8000U << TIM_OR_CCR1_EXT_Pos) 

/* OR */
#define  TIM_OR_TI4_RMP_Pos                       (6)
#define  TIM_OR_TI4_RMP_Msk                       (0x3U << TIM_OR_TI4_RMP_Pos)                      /*!<TI4 multiplex*/
#define  TIM_OR_TI4_RMP                           TIM_OR_TI4_RMP_Msk
#define  TIM_OR_TI4_RMP_Bit0                      (0x1U << TIM_OR_TI4_RMP_Pos) 
#define  TIM_OR_TI4_RMP_Bit1                      (0x2U << TIM_OR_TI4_RMP_Pos) 

/**
  * @brief TIM_CCMR3 Register Bit Definition
  */
#define  TIM_CCMR3_OC5PE_Pos                      (3)
#define  TIM_CCMR3_OC5PE_Msk                      (0x1U << TIM_CCMR3_OC5PE_Pos)                     /*!<Output compare 5 preload enable*/
#define  TIM_CCMR3_OC5PE                          TIM_CCMR3_OC5PE_Msk
#define  TIM_CCMR3_OC6PE_Pos                      (11)
#define  TIM_CCMR3_OC6PE_Msk                      (0x1U << TIM_CCMR3_OC6PE_Pos)                     /*!<Output compare 6 preload enable*/
#define  TIM_CCMR3_OC6PE                          TIM_CCMR3_OC6PE_Msk

/**
  * @brief TIM_CCR5 Register Bit Definition
  */
#define  TIM_CCR5_CCR5_Pos                        (0)
#define  TIM_CCR5_CCR5_Msk                        (0xFFFFU << TIM_CCR5_CCR5_Pos)                    /*!<Compare 5 value*/
#define  TIM_CCR5_CCR5                            TIM_CCR5_CCR5_Msk
#define  TIM_CCR5_CCR5_Bit0                       (0x0001U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit1                       (0x0002U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit2                       (0x0004U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit3                       (0x0008U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit4                       (0x0010U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit5                       (0x0020U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit6                       (0x0040U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit7                       (0x0080U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit8                       (0x0100U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit9                       (0x0200U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit10                      (0x0400U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit11                      (0x0800U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit12                      (0x1000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit13                      (0x2000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit14                      (0x4000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit15                      (0x8000U << TIM_CCR5_CCR5_Pos) 

/**
  * @brief TIM_PDER Register Bit Definition
  */
#define  TIM_PDER_CCDREPE_Pos                     (0)
#define  TIM_PDER_CCDREPE_Msk                     (0x1U << TIM_PDER_CCDREPE_Pos)                    /*!<Enable DMA will generate the update request at each underflow or overflow*/
#define  TIM_PDER_CCDREPE                         TIM_PDER_CCDREPE_Msk
#define  TIM_PDER_CCR1_SHIFT_EN_Pos               (1)
#define  TIM_PDER_CCR1_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR1_SHIFT_EN_Pos)              /*!<Enable channel 1 output PWM phase shift bit*/
#define  TIM_PDER_CCR1_SHIFT_EN                   TIM_PDER_CCR1_SHIFT_EN_Msk
#define  TIM_PDER_CCR2_SHIFT_EN_Pos               (2)
#define  TIM_PDER_CCR2_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR2_SHIFT_EN_Pos)              /*!<Enable channel 2 output PWM phase shift bit*/
#define  TIM_PDER_CCR2_SHIFT_EN                   TIM_PDER_CCR2_SHIFT_EN_Msk
#define  TIM_PDER_CCR3_SHIFT_EN_Pos               (3)
#define  TIM_PDER_CCR3_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR3_SHIFT_EN_Pos)              /*!<Enable channel 3 output PWM phase shift bit*/
#define  TIM_PDER_CCR3_SHIFT_EN                   TIM_PDER_CCR3_SHIFT_EN_Msk
#define  TIM_PDER_CCR4_SHIFT_EN_Pos               (4)
#define  TIM_PDER_CCR4_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR4_SHIFT_EN_Pos)              /*!<Enable channel 4 output PWM phase shift bit*/
#define  TIM_PDER_CCR4_SHIFT_EN                   TIM_PDER_CCR4_SHIFT_EN_Msk
#define  TIM_PDER_CCR5_SHIFT_EN_Pos               (5)
#define  TIM_PDER_CCR5_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR5_SHIFT_EN_Pos)              /*!<Enable channel 5 output PWM phase shift bit*/
#define  TIM_PDER_CCR5_SHIFT_EN                   TIM_PDER_CCR5_SHIFT_EN_Msk
#define  TIM_PDER_CCR6_SHIFT_EN_Pos               (6)
#define  TIM_PDER_CCR6_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR6_SHIFT_EN_Pos)              /*!<Enable channel 6 output PWM phase shift bit*/
#define  TIM_PDER_CCR6_SHIFT_EN                   TIM_PDER_CCR6_SHIFT_EN_Msk
#define  TIM_PDER_CCR1_WINDOW_EN_Pos              (9)
#define  TIM_PDER_CCR1_WINDOW_EN_Msk              (0x1U << TIM_PDER_CCR1_WINDOW_EN_Pos)             /*!<*/
#define  TIM_PDER_CCR1_WINDOW_EN                  TIM_PDER_CCR1_WINDOW_EN_Msk
#define  TIM_PDER_CCR2_WINDOW_EN_Pos              (10)
#define  TIM_PDER_CCR2_WINDOW_EN_Msk              (0x1U << TIM_PDER_CCR2_WINDOW_EN_Pos)             /*!<*/
#define  TIM_PDER_CCR2_WINDOW_EN                  TIM_PDER_CCR2_WINDOW_EN_Msk
#define  TIM_PDER_CCR3_WINDOW_EN_Pos              (11)
#define  TIM_PDER_CCR3_WINDOW_EN_Msk              (0x1U << TIM_PDER_CCR3_WINDOW_EN_Pos)             /*!<*/
#define  TIM_PDER_CCR3_WINDOW_EN                  TIM_PDER_CCR3_WINDOW_EN_Msk
#define  TIM_PDER_CCR4_WINDOW_EN_Pos              (12)
#define  TIM_PDER_CCR4_WINDOW_EN_Msk              (0x1U << TIM_PDER_CCR4_WINDOW_EN_Pos)             /*!<*/
#define  TIM_PDER_CCR4_WINDOW_EN                  TIM_PDER_CCR4_WINDOW_EN_Msk
#define  TIM_PDER_CCR5_WINDOW_EN_Pos              (13)
#define  TIM_PDER_CCR5_WINDOW_EN_Msk              (0x1U << TIM_PDER_CCR5_WINDOW_EN_Pos)             /*!<*/
#define  TIM_PDER_CCR5_WINDOW_EN                  TIM_PDER_CCR5_WINDOW_EN_Msk
#define  TIM_PDER_CCR6_WINDOW_EN_Pos              (14)
#define  TIM_PDER_CCR6_WINDOW_EN_Msk              (0x1U << TIM_PDER_CCR6_WINDOW_EN_Pos)             /*!<*/
#define  TIM_PDER_CCR6_WINDOW_EN                  TIM_PDER_CCR6_WINDOW_EN_Msk

