SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Application/Device/MM32SPIN0260/Include/reg_tim.h
/**
  * @brief TIM_CCREXT Register Bit Definition
  */
#define  TIM_CCR1EXT_CCRxEXT_Pos                  (0)
#define  TIM_CCR1EXT_CCRxEXT_Msk                  (0xFFFFU << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT                      TIM_CCR1EXT_CCRxEXT_Msk                           /*!<The channel x capture/compare extension register can be configured with different PWM modes through TIMx_PDER to achieve various PWM output waveforms. Note: x = 1~5 Note: CCR5 and CCR5EXT cannot directly control PWM output. However, when CCR5_SHIFT_EN or CCR5_WINDOW_EN is enabled, the CC5_SETTRGO output signal will exhibit corresponding changes.*/
#define  TIM_CCR1EXT_CCRxEXT_Bit0                 (0x0001U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit1                 (0x0002U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit2                 (0x0004U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit3                 (0x0008U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit4                 (0x0010U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit5                 (0x0020U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit6                 (0x0040U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit7                 (0x0080U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit8                 (0x0100U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit9                 (0x0200U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit10                (0x0400U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit11                (0x0800U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit12                (0x1000U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit13                (0x2000U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit14                (0x4000U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR1EXT_CCRxEXT_Bit15                (0x8000U << TIM_CCR1EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Pos                  (0)
#define  TIM_CCR2EXT_CCRxEXT_Msk                  (0xFFFFU << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT                      TIM_CCR2EXT_CCRxEXT_Msk                           /*!<The channel x capture/compare extension register can be configured with different PWM modes through TIMx_PDER to achieve various PWM output waveforms. Note: x = 1~5 Note: CCR5 and CCR5EXT cannot directly control PWM output. However, when CCR5_SHIFT_EN or CCR5_WINDOW_EN is enabled, the CC5_SETTRGO output signal will exhibit corresponding changes.*/
#define  TIM_CCR2EXT_CCRxEXT_Bit0                 (0x0001U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit1                 (0x0002U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit2                 (0x0004U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit3                 (0x0008U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit4                 (0x0010U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit5                 (0x0020U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit6                 (0x0040U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit7                 (0x0080U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit8                 (0x0100U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit9                 (0x0200U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit10                (0x0400U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit11                (0x0800U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit12                (0x1000U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit13                (0x2000U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit14                (0x4000U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR2EXT_CCRxEXT_Bit15                (0x8000U << TIM_CCR2EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Pos                  (0)
#define  TIM_CCR3EXT_CCRxEXT_Msk                  (0xFFFFU << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT                      TIM_CCR3EXT_CCRxEXT_Msk                           /*!<The channel x capture/compare extension register can be configured with different PWM modes through TIMx_PDER to achieve various PWM output waveforms. Note: x = 1~5 Note: CCR5 and CCR5EXT cannot directly control PWM output. However, when CCR5_SHIFT_EN or CCR5_WINDOW_EN is enabled, the CC5_SETTRGO output signal will exhibit corresponding changes.*/
#define  TIM_CCR3EXT_CCRxEXT_Bit0                 (0x0001U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit1                 (0x0002U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit2                 (0x0004U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit3                 (0x0008U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit4                 (0x0010U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit5                 (0x0020U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit6                 (0x0040U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit7                 (0x0080U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit8                 (0x0100U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit9                 (0x0200U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit10                (0x0400U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit11                (0x0800U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit12                (0x1000U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit13                (0x2000U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit14                (0x4000U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR3EXT_CCRxEXT_Bit15                (0x8000U << TIM_CCR3EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Pos                  (0)
#define  TIM_CCR4EXT_CCRxEXT_Msk                  (0xFFFFU << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT                      TIM_CCR4EXT_CCRxEXT_Msk                           /*!<The channel x capture/compare extension register can be configured with different PWM modes through TIMx_PDER to achieve various PWM output waveforms. Note: x = 1~5 Note: CCR5 and CCR5EXT cannot directly control PWM output. However, when CCR5_SHIFT_EN or CCR5_WINDOW_EN is enabled, the CC5_SETTRGO output signal will exhibit corresponding changes.*/
#define  TIM_CCR4EXT_CCRxEXT_Bit0                 (0x0001U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit1                 (0x0002U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit2                 (0x0004U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit3                 (0x0008U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit4                 (0x0010U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit5                 (0x0020U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit6                 (0x0040U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit7                 (0x0080U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit8                 (0x0100U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit9                 (0x0200U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit10                (0x0400U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit11                (0x0800U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit12                (0x1000U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit13                (0x2000U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit14                (0x4000U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR4EXT_CCRxEXT_Bit15                (0x8000U << TIM_CCR4EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Pos                  (0)
#define  TIM_CCR5EXT_CCRxEXT_Msk                  (0xFFFFU << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT                      TIM_CCR5EXT_CCRxEXT_Msk                           /*!<The channel x capture/compare extension register can be configured with different PWM modes through TIMx_PDER to achieve various PWM output waveforms. Note: x = 1~5 Note: CCR5 and CCR5EXT cannot directly control PWM output. However, when CCR5_SHIFT_EN or CCR5_WINDOW_EN is enabled, the CC5_SETTRGO output signal will exhibit corresponding changes.*/
#define  TIM_CCR5EXT_CCRxEXT_Bit0                 (0x0001U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit1                 (0x0002U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit2                 (0x0004U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit3                 (0x0008U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit4                 (0x0010U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit5                 (0x0020U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit6                 (0x0040U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit7                 (0x0080U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit8                 (0x0100U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit9                 (0x0200U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit10                (0x0400U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit11                (0x0800U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit12                (0x1000U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit13                (0x2000U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit14                (0x4000U << TIM_CCR5EXT_CCRxEXT_Pos) 
#define  TIM_CCR5EXT_CCRxEXT_Bit15                (0x8000U << TIM_CCR5EXT_CCRxEXT_Pos) 

/**
  * @brief TIM_BKINF Register Bit Definition
  */
#define  TIM_BKINF_BKINFE_Pos                     (0)
#define  TIM_BKINF_BKINFE_Msk                     (0x1U << TIM_BKINF_BKINFE_Pos)                    /*!<Break input filter enable*/
#define  TIM_BKINF_BKINFE                         TIM_BKINF_BKINFE_Msk
#define  TIM_BKINF_BKINF_Pos                      (1)
#define  TIM_BKINF_BKINF_Msk                      (0xFU << TIM_BKINF_BKINF_Pos)                     /*!<Break input filter*/
#define  TIM_BKINF_BKINF                          TIM_BKINF_BKINF_Msk
#define  TIM_BKINF_BKINF_Bit0                     (0x1U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit1                     (0x2U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit2                     (0x4U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit3                     (0x8U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_CSSBKIN_SEL_Pos                (5)
#define  TIM_BKINF_CSSBKIN_SEL_Msk                (0x1U << TIM_BKINF_CSSBKIN_SEL_Pos)               /*!<CSS break input channel selects*/
#define  TIM_BKINF_CSSBKIN_SEL                    TIM_BKINF_CSSBKIN_SEL_Msk
#define  TIM_BKINF_IOBKIN_SEL_L_Pos               (6)
#define  TIM_BKINF_IOBKIN_SEL_L_Msk               (0x7FU << TIM_BKINF_IOBKIN_SEL_L_Pos)             /*!<IO break input channel selects*/
#define  TIM_BKINF_IOBKIN_SEL_L                   TIM_BKINF_IOBKIN_SEL_L_Msk
#define  TIM_BKINF_IOBKIN_SEL_L_Bit0              (0x01U << TIM_BKINF_IOBKIN_SEL_L_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_L_Bit1              (0x02U << TIM_BKINF_IOBKIN_SEL_L_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_L_Bit2              (0x04U << TIM_BKINF_IOBKIN_SEL_L_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_L_Bit3              (0x08U << TIM_BKINF_IOBKIN_SEL_L_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_L_Bit4              (0x10U << TIM_BKINF_IOBKIN_SEL_L_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_L_Bit5              (0x20U << TIM_BKINF_IOBKIN_SEL_L_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_L_Bit6              (0x40U << TIM_BKINF_IOBKIN_SEL_L_Pos) 
#define  TIM_BKINF_BKIN_SEL_Pos                   (6)
#define  TIM_BKINF_BKIN_SEL_Msk                   (0x3FU << TIM_BKINF_BKIN_SEL_Pos)                 /*!<IO break input channel selects*/
#define  TIM_BKINF_BKIN_SEL                       TIM_BKINF_BKIN_SEL_Msk
#define  TIM_BKINF_BKIN_SEL_Bit0                  (0x01U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_Bit1                  (0x02U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_Bit2                  (0x04U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_Bit3                  (0x08U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_Bit4                  (0x10U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_BKIN_SEL_Bit5                  (0x20U << TIM_BKINF_BKIN_SEL_Pos) 
#define  TIM_BKINF_COMPBKIN_SEL_Pos               (13)
#define  TIM_BKINF_COMPBKIN_SEL_Msk               (0x3U << TIM_BKINF_COMPBKIN_SEL_Pos)              /*!<COMP break input sel*/
#define  TIM_BKINF_COMPBKIN_SEL                   TIM_BKINF_COMPBKIN_SEL_Msk
#define  TIM_BKINF_COMPBKIN_SEL_Bit0              (0x1U << TIM_BKINF_COMPBKIN_SEL_Pos) 
#define  TIM_BKINF_COMPBKIN_SEL_Bit1              (0x2U << TIM_BKINF_COMPBKIN_SEL_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_H_Pos               (24)
#define  TIM_BKINF_IOBKIN_SEL_H_Msk               (0x1U << TIM_BKINF_IOBKIN_SEL_H_Pos)              /*!<IO break input sel*/
#define  TIM_BKINF_IOBKIN_SEL_H                   TIM_BKINF_IOBKIN_SEL_H_Msk

/**
  * @brief TIM_CCR6 Register Bit Definition
  */
#define  TIM_CCR6_CCR6_Pos                        (0)
#define  TIM_CCR6_CCR6_Msk                        (0xFFFFU << TIM_CCR6_CCR6_Pos)                    /*!<Capture/Compare 6 value*/
#define  TIM_CCR6_CCR6                            TIM_CCR6_CCR6_Msk
#define  TIM_CCR6_CCR6_Bit0                       (0x0001U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit1                       (0x0002U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit2                       (0x0004U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit3                       (0x0008U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit4                       (0x0010U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit5                       (0x0020U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit6                       (0x0040U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit7                       (0x0080U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit8                       (0x0100U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit9                       (0x0200U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit10                      (0x0400U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit11                      (0x0800U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit12                      (0x1000U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit13                      (0x2000U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit14                      (0x4000U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit15                      (0x8000U << TIM_CCR6_CCR6_Pos) 

/**
  * @brief TIM_CCR6EXT Register Bit Definition
  */
#define  TIM_CCR6EXT_CCR6EXT_Pos                  (0)
#define  TIM_CCR6EXT_CCR6EXT_Msk                  (0xFFFFU << TIM_CCR6EXT_CCR6EXT_Pos)              /*!<Channel x compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCRxFALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR6EXT_CCR6EXT                      TIM_CCR6EXT_CCR6EXT_Msk
#define  TIM_CCR6EXT_CCR6EXT_Bit0                 (0x0001U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit1                 (0x0002U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit2                 (0x0004U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit3                 (0x0008U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit4                 (0x0010U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit5                 (0x0020U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit6                 (0x0040U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit7                 (0x0080U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit8                 (0x0100U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit9                 (0x0200U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit10                (0x0400U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit11                (0x0800U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit12                (0x1000U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit13                (0x2000U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit14                (0x4000U << TIM_CCR6EXT_CCR6EXT_Pos) 
#define  TIM_CCR6EXT_CCR6EXT_Bit15                (0x8000U << TIM_CCR6EXT_CCR6EXT_Pos) 

/**
  * @brief TIM_DOCR Register Bit Definition
  */
#define  TIM_DOCR_DOS_Pos                         (0)
#define  TIM_DOCR_DOS_Msk                         (0x7U << TIM_DOCR_DOS_Pos)                        /*!<Debug halt Output select*/
#define  TIM_DOCR_DOS                             TIM_DOCR_DOS_Msk
#define  TIM_DOCR_DOS_Bit0                        (0x1U << TIM_DOCR_DOS_Pos) 
#define  TIM_DOCR_DOS_Bit1                        (0x2U << TIM_DOCR_DOS_Pos) 
#define  TIM_DOCR_DOS_Bit2                        (0x4U << TIM_DOCR_DOS_Pos) 

/**
  * @brief TIM_SOER Register Bit Definition
  */
#define  TIM_SOER_SOEN_Pos                        (0)
#define  TIM_SOER_SOEN_Msk                        (0x1U << TIM_SOER_SOEN_Pos)                       /*!<Soft Output Enable*/
#define  TIM_SOER_SOEN                            TIM_SOER_SOEN_Msk

/**
  * @brief TIM_SOCR Register Bit Definition
  */
#define  TIM_SOCR_SFTV_Pos                        (0)
#define  TIM_SOCR_SFTV_Msk                        (0xFFU << TIM_SOCR_SFTV_Pos)                      /*!<Soft Output Value*/
#define  TIM_SOCR_SFTV                            TIM_SOCR_SFTV_Msk
#define  TIM_SOCR_SFTV_Bit0                       (0x01U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit1                       (0x02U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit2                       (0x04U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit3                       (0x08U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit4                       (0x10U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit5                       (0x20U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit6                       (0x40U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit7                       (0x80U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTEN_Pos                       (8)
#define  TIM_SOCR_SFTEN_Msk                       (0xFFU << TIM_SOCR_SFTEN_Pos)                     /*!<Soft Output Enable*/
#define  TIM_SOCR_SFTEN                           TIM_SOCR_SFTEN_Msk
#define  TIM_SOCR_SFTEN_Bit0                      (0x01U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit1                      (0x02U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit2                      (0x04U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit3                      (0x08U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit4                      (0x10U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit5                      (0x20U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit6                      (0x40U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit7                      (0x80U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_BSFTV_Pos                       (16)
#define  TIM_SOCR_BSFTV_Msk                       (0xFFU << TIM_SOCR_BSFTV_Pos)                     /*!<Break Soft Output Value*/
#define  TIM_SOCR_BSFTV                           TIM_SOCR_BSFTV_Msk
#define  TIM_SOCR_BSFTV_Bit0                      (0x01U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit1                      (0x02U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit2                      (0x04U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit3                      (0x08U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit4                      (0x10U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit5                      (0x20U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit6                      (0x40U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit7                      (0x80U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTEN_Pos                      (24)
#define  TIM_SOCR_BSFTEN_Msk                      (0xFFU << TIM_SOCR_BSFTEN_Pos)                    /*!<Break Soft Output Enable*/
#define  TIM_SOCR_BSFTEN                          TIM_SOCR_BSFTEN_Msk
#define  TIM_SOCR_BSFTEN_Bit0                     (0x01U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit1                     (0x02U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit2                     (0x04U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit3                     (0x08U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit4                     (0x10U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit5                     (0x20U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit6                     (0x40U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit7                     (0x80U << TIM_SOCR_BSFTEN_Pos) 

/**
  * @brief TIM_BKSR Register Bit Definition
  */
#define  TIM_BKSR_CSSBF_Pos                       (0)
#define  TIM_BKSR_CSSBF_Msk                       (0x1U << TIM_BKSR_CSSBF_Pos)                      /*!<CSSBF Break Flag*/
#define  TIM_BKSR_CSSBF                           TIM_BKSR_CSSBF_Msk
#define  TIM_BKSR_IOBF_Pos                        (1)
#define  TIM_BKSR_IOBF_Msk                        (0x1U << TIM_BKSR_IOBF_Pos)                       /*!<IO Break Flag*/
#define  TIM_BKSR_IOBF                            TIM_BKSR_IOBF_Msk
#define  TIM_BKSR_BCPTF1_Pos                      (2)
#define  TIM_BKSR_BCPTF1_Msk                      (0x1U << TIM_BKSR_BCPTF1_Pos)                     /*!<CMP1 Break Flag*/
#define  TIM_BKSR_BCPTF1                          TIM_BKSR_BCPTF1_Msk
#define  TIM_BKSR_BCPTF2_Pos                      (3)
#define  TIM_BKSR_BCPTF2_Msk                      (0x1U << TIM_BKSR_BCPTF2_Pos)                     /*!<CMP2 Break Flag*/
#define  TIM_BKSR_BCPTF2                          TIM_BKSR_BCPTF2_Msk


#endif

